# ML0.2(1) Pandas
# Цель работы: 
## На практике ознакомиться с основными приемами обработки данных с использованием библиотеки pandas, освоить основные понятия этой библиотеки

In [1]:
import pandas as pd
import datetime as dt
import numpy as np

### 1.	Получить файл (Titanic.csv) набора данных, прилагающийся к этой работе.

### 2.	Считать файл в pandas DataFrame

In [2]:
df = pd.read_csv('Titanic.csv', sep=',')

df.head(5)

,Name,PClass,Age,Sex,Survived
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0
4,"Allison, Master Hudson Trevor",1st,0.92,male,1

### 3.	Ознакомиться с основными параметрами датасета, используя функции библиотеки pandas, включая следующие данные:

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1313 entries, 0 to 1312
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      1313 non-null   object
 1   PClass    1312 non-null   object
 2   Age       756 non-null    float64
 3   Sex       1313 non-null   object
 4   Survived  1313 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 51.4+ KB

#### a.	Количество точек данных (измерений) в наборе

In [4]:
df.shape[0]

1313

#### b.	Количество полей данных (атрибутов)

In [5]:
df.shape[1]

5

#### c.	Тип данных каждого поля, шкала каждого поля

In [8]:
print(f'   типы данных \n{df.dtypes}')
print(f'    шкалы \n{df.apply(lambda s: s.unique())}')

   типы данных
Name         object
PClass       object
Age         float64
Sex          object
Survived      int64
dtype: object
    шкалы
Name        [Allen, Miss Elisabeth Walton, Allison, Miss H...
PClass                                   [1st, 2nd, nan, 3rd]
Age         [29.0, 2.0, 30.0, 25.0, 0.92, 47.0, 63.0, 39.0...
Sex                                            [female, male]
Survived                                               [1, 0]
dtype: object

#### d.	Количество отсутствующих значений для каждого поля

In [9]:
df.isna().sum()

Name          0
PClass        1
Age         557
Sex           0
Survived      0
dtype: int64

#### e.	Количество и названия константных и уникальных полей

In [11]:
print('Количество константных полей: ', df.apply(lambda s: len(s.unique()) == 1).sum())
print('Количество уникальных полей: ', df.apply(lambda s: len(s.unique()) == len(s)).sum())

Количество константных полей:  0
Количество уникальных полей:  0

### 4.	Удалить из набора поля, не несущие информативной нагрузки - содержащие уникальные либо константные значения

In [12]:
df = df.drop(['Name'], axis=1) 
df.head()

  PClass    Age     Sex  Survived
0    1st  29.00  female         1
1    1st   2.00  female         0
2    1st  30.00    male         0
3    1st  25.00  female         0
4    1st   0.92    male         1

### 5.	Заменить возраст пассажиров на год рождения

In [13]:
df['Age'] = 1912 - df['Age']
df.head()

  PClass      Age     Sex  Survived
0    1st  1883.00  female         1
1    1st  1910.00  female         0
2    1st  1882.00    male         0
3    1st  1887.00  female         0
4    1st  1911.08    male         1

### 6.	Переименовать все названия колонок на русском языке

In [18]:
df.columns = ['Класс пассажира', 'Год рождения', 'Пол', 'Выжил(а)']
df

     Класс пассажира  Год рождения     Пол  Выжил(а)
0                1st       1883.00  female         1
1                1st       1910.00  female         0
2                1st       1882.00    male         0
3                1st       1887.00  female         0
4                1st       1911.08    male         1
...              ...           ...     ...       ...
1308             3rd       1885.00    male         0
1309             3rd       1886.00    male         0
1310             3rd       1890.00    male         0
1311             3rd       1888.00    male         0
1312             3rd       1883.00    male         0

[1313 rows x 4 columns]

### 7.	Заменить все отсутствующие данные средним значением (в случае числового поля) либо самым распространенным в категориальных полях.

In [16]:
df.isna().sum()

Класс             1
Год рождения    557
Пол               0
Выжил(а)          0
dtype: int64

In [19]:
df['Год рождения'] = df['Год рождения'].fillna(df['Год рождения'].mean())
df['Класс пассажира'] = df['Класс пассажира'].fillna(df['Класс пассажира'].mode().item())
df['Год рождения'] = df['Год рождения'].astype(int)

df.head()

  Класс пассажира  Год рождения     Пол  Выжил(а)
0             1st          1883  female         1
1             1st          1910  female         0
2             1st          1882    male         0
3             1st          1887  female         0
4             1st          1911    male         1

### 8.	Сохранить получившийся набор данных в формате CSV в файле ФИО_Titanic.csv

In [24]:
df.to_csv('Бедак_Titanic.csv', encoding='cp1251', index=False, sep=';')

### 9.	Открыть данный файл в программе Microsoft Excel и сохранить в формате .xlsx

### 10.	Считать файл .xlsx в новый DataFrame

In [26]:
data_new = pd.read_excel("Бедак_Titanic.xlsx")
data_new.head()

  Класс пассажира  Год рождения     Пол  Выжил(а)
0             1st          1883  female         1
1             1st          1910  female         0
2             1st          1882    male         0
3             1st          1887  female         0
4             1st          1911    male         1

# Контрольные вопросы

### 1.	Какие две главные структуры данных используются в pandas? В чем их отличие?

<p>Series - одномерный массив фиксированного типа данных (если массив типа int, то в нём не может быть данных string)
<p>DataFrame - список из нескольких Series (может содержать в себе Series разных типов)

### 2.	Назовите основные функции чтения данных из файлов в Pandas.

<p>.read_csv()
<p>.read_pickle()
<p>.read_json()
<p>.read_exel()
<p>.read_parquet()

### 3.	Напишите функцию записи набора данных А в файл с разделителями-запятыми.

df.to_csv('df.csv', sep=';')

### 4.	Как называется функция, выводящая на экран первые N строчек набора данных

df.head(N)

### 5.	С помощью какой функции можно удалить поле набора данных? А строку?

<p>Поле - df.drop(axis = 1)
<p>Строку - df.drop(axis = 0)

### 6.	Напишите участок кода, демонстрирующий возможность добавления новой строки к набору данных.

df.append(new_row, ignore_index=True)

### 7.	Напишите участок кода, демонстрирующий возможность добавления новой колонки (поля) к набору данных.

df['new_column'] = new_column